IdeaRS.OpenModel.Geometry2D.Point2D
Represents an x- and y-coordinate pair in two-dimensional space.

IdeaRS.OpenModel.Geometry2D.Point2D.X
Gets or sets the X-coordinate value

IdeaRS.OpenModel.Geometry2D.Point2D.Y
Gets or sets the Y-coordinate value